# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Brews (Packagex)
brew "bash"
brew "bash-completion"
brew "bat"
brew "glib"
brew "python@3.9"
brew "unbound"
brew "gnutls"
brew "cask"
brew "ccache"
brew "cmake"
brew "conan"
brew "dfu-util"
brew "direnv"
brew "doxygen"
brew "exa"
brew "fetch"
brew "gcovr"
brew "git"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "graphviz"
brew "httpie"
brew "jq"
brew "lcov"
brew "libsecret"
brew "nghttp2"
brew "ninja"
brew "node"
brew "ruby-build"
brew "rbenv"
brew "wget"
brew "zsh"

# Casks (Applications)
cask "alfred"
cask "dropbox"
